Revit 2027 API
TableSectionData.GetCellFormatOptions(Int32, Int32, Document) Method
 Returns a cell's FormatOptions and if no FormatOptions exists for this cell, it would come from the column, or the row, or the section.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FormatOptions GetCellFormatOptions(
	int nRow,
	int nCol,
	Document document
)
Public Function GetCellFormatOptions (
	nRow As Integer,
	nCol As Integer,
	document As Document
) As FormatOptions
public:
FormatOptions^ GetCellFormatOptions(
	int nRow,
	int nCol,
	Document^ document
)
member GetCellFormatOptions :
        nRow : int *
        nCol : int *
        document : Document -> FormatOptions
Parameters
nRow Int32
nCol Int32
document Document
Return Value
FormatOptions
Exceptions
Exception | Condition
ArgumentException |  The given row number nRow is invalid. -or- The given column number nCol is invalid.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
TableSectionData Class
GetCellFormatOptions Overload
Autodesk.Revit.DB Namespace